#include<iostream>
#include"1_stdmove.h"

int main()
{
/*C++三法则：
*		如果需要析构函数，那么一定需要拷贝构造函数和拷贝复制操作符
*C++五法则：
*		为了支持移动语义，又增加了移动构造函数和移动赋值运算符
*/

	std::cout << "\n\n=====================day10======================\n" << std::endl;

	std::cout << "\n=====================stdmove======================" << std::endl;
	StdMove_Func();

	std::cout << "\n=====================第四课======================" << std::endl;


	std::cout << "\n=====================第五课======================" << std::endl;


	std::cout << "\n=====================第六课======================" << std::endl;


	std::cout << "\n=====================第七课======================" << std::endl;


	std::cout << "\n=====================第十课======================" << std::endl;



	std::cin.get();
}
